PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/application/default/mai_main.c
/**
 * @file mai_main.c
 * The main entry point of the C code. In this sample it configures and runs the RTOS.
 * Some tasks are registered that implement blinking LEDs and more.\n
 *   A cyclic 1ms task controls one LED such that it blinks at 1 Hz. The task reads the
 * state of the buttons on the evaluation board. On button press an according event task,
 * taskOnButtonDown, is activated.\n
 *   The event task taskOnButtonDown reports each button event by printing a message to the
 * serial COM channel. At the same time it increments the amount of CPU load by 10% load,
 * which is (artificially) produced by task taskCpuLoad. This is a cyclic task with a busy
 * wait loop.\n
 *   A cyclic 1000ms task toggles the second LED at a rate of 0.5 Hz.\n
 *   An event task taskNonCyclic is activated by several other tasks under different
 * conditions. It can be observed that the activation sometime succeeds and sometime fails
 * - depending on these conditions.\n
 *   The regular 1s task is used to report the system state, CPU load, stack usage and task
 * overrun events (more precise: failed activations).\n
 *   The idle task measures the CPU load.\n
 *   Three timer interrupts fire at high speed and on a time grid, which is asynchronous to
 * the normal application tasks. This leads to most variable preemption patterns. The
 * interrupts do nothing but producing system load and one of them participates the
 * software self-test (consistency check of shared data).
 *
 * The application should be run with a connected terminal. The terminal should be
 * configured for 115200 Bd, 8 Bits, no parity, 1 start and 1 stop bit.
 *
 * Some observations:\n
 *   Blinking LEDs: Note the slight phase shift due to the differing task start times.\n
 *   Reported CPU load: At nominal 100% artificial load it drops to about 50%. The
 * execution time of the cyclic task that produces the load exceeds the nominal cycle time
 * of the task and every second activation is lost. The activation loss counter in the
 * RTOS' task array constantly increases.\n
 *   Occasional activation losses can be reported for task taskNonCyclic. It can be
 * preempted by task task17ms and this task activates task taskNonCyclic. If it tries to
 * do, while it has preempted task taskNonCyclic, the activation is not possible.\n
 *   The code runs a permanent test of the different offered mechanisms of mutual exclusion
 * of tasks that access some shared data objects. A recognized failure is reported by
 * assertion, which will halt the code execution (in DEBUG compilation only). Everything is
 * fine as long as the LEDs continue blinking.
 *
 * Copyright (C) 2017-2019 Peter Vranken (mailto:Peter_Vranken@Yahoo.de)
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the GNU Lesser General Public License as published by the
 * Free Software Foundation, either version 3 of the License, or any later
 * version.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License
 * for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 */
/* Module interface
 *   main
 * Local functions
 *   checkAndIncrementTaskCnts
 *   testPCP_checkDataConsistency
 *   testPCP
 *   isrPit1
 *   isrPit2
 *   isrPit3
 *   taskOs1ms
 *   onButtonChangeCallback
 *   task1ms
 *   task3ms
 *   task1s
 *   taskNonCyclic
 *   task17ms
 *   taskOnButtonDown
 *   taskCpuLoad
 *   installInterruptServiceRoutines
 *   taskInitProcess
 *   taskIdlePID2
 */

/*
 * Include files
 */

#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <math.h>
#include <float.h>
#include <limits.h>
#include <assert.h>

#include "MPC5643L.h"
#include "typ_types.h"
#include "ihw_initMcuCoreHW.h"
#include "lbd_ledAndButtonDriver.h"
#include "sio_serialIO.h"
#include "prc_process.h"
#include "mpu_systemMemoryProtectionUnit.h"
#include "rtos.h"
#include "del_delay.h"
#include "gsl_systemLoad.h"
#include "tcx_testContext.h"
#include "mai_main.h"


/*
 * Defines
 */

/** The demo can be compiled with a ground load. Most tasks produce some CPU load if this
    switch is set to 1. */
#define TASKS_PRODUCE_GROUND_LOAD   0

/** The test of the priority ceiling protocol counts recognized errors, which are reproted
    by console output and to the debugger. Alternatively and by setting this macro to 1,
    the software execution can be halted on recognition of the first error. The no longer
    blinking LEDs would indicate the problem. */
#define HALT_ON_PCP_TEST_FAILURE    1

/** A wrapper around the API for the priority ceiling protocal (PCP), which lets the API
    for mutual exclusion of a task set look like the API calls from the OSEK/VDX standard.
      Here, for getting the resource, i.e. for entering a critical section of code. */
#define GetResource(resource)                                                               \
            { uint32_t priorityLevelSoFar = rtos_suspendAllInterruptsByPriority             \
                                                (/* suspendUpToThisPriority */ (resource));

/** A wrapper around the API for the priority ceiling protocal (PCP), which lets the API
    for mutual exclusion of a task set look like the API calls from the OSEK/VDX standard.
      Here, for returning the resource, i.e. for leaving a critical section of code. */
#define ReleaseResource() rtos_resumeAllInterruptsByPriority(priorityLevelSoFar); }

/** The task counter array is accessed by all tasks. Here it is modelled as an OSEK/VDX
    like resource to be used with #GetResource and #ReleaseResource. */
#define RESOURCE_CNT_TASK_ARY   (MAXP(RESOURCE_ALL_TASKS,prioISRPit1))

/** The priority level to set if all tasks should be mutually excluded from accessing a
    shared resource. The macro is named such that the code resembles the resource API from
    the OSEK/VDX standard. */
#define RESOURCE_ALL_TASKS  (MAXP(prioTask1ms,MAXP(prioTask3ms, \
                             MAXP(prioTask1s,MAXP(prioTaskNonCyclic, \
                             MAXP(prioTask17ms,MAXP(prioTaskOnButtonDown, \
                             prioTaskCpuLoad)))))))

/** The priority level to set for the activation of task taskNonCyclic. The call of
    rtos_activateTask(task) is not reentrant; if several tasks want to activate one and the
    same task then this call needs to be placed into a critical section. The macro is named
    such that the code resembles the resource API from the OSEK/VDX standard. */
#define RESOURCE_ACTIVATE_TASK_NON_CYCLIC \
                            (MAXP(prioTask1ms,MAXP(prioTask17ms, \
                             MAXP(prioTaskOs1ms,prioTaskIdle))))

/** The priority level to set for the atomic operations done in function testPCP(). The
    macro is named such that the code resembles the resource API from the OSEK/VDX
    standard. */
#define RESOURCE_TEST_PCP  (MAXP(prioTask1ms,MAXP(prioTaskCpuLoad,prioTaskIdle)))

/** Some helper code to get the maximum task priority as a constant for the priority ceiling
    protocol. */
#define MAXP(p1,p2)  ((p2)>(p1)?(p2):(p1))


