PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/application/default/mai_main.c
/*
 * Local type definitions
 */

/** The enumeration of all tasks; the values are the task IDs. Actually, the ID is provided
    by the RTOS at runtime, when registering the task. However, it is guaranteed that the
    IDs, which are dealt out by rtos_createEvent() form the series 0, 1, 2, ..., 7. So
    we don't need to have a dynamic storage of the IDs; we define them as constants and
    double-check by assertion that we got the correct, expected IDs. Note, this requires
    that the order of registering the tasks follows the order here in the enumeration. */
enum
{
    /** The ID of the registered application tasks. They occupy the index range starting
        from zero. */
    idEv1ms = 0
    , idEv3ms
    , idEv1s
    , idEvNonCyclic
    , idEv17ms
    , idEvOnButtonDown
    , idEvCpuLoad

    /** In this sample, we have a one by one relation between events and tasks for most
        tasks. We duplicate the event IDs to have task IDs, too. */
    , idTask1ms          = idEv1ms
    , idTask3ms          = idEv3ms
    , idTask1s           = idEv1s
    , idTaskNonCyclic    = idEvNonCyclic
    , idTask17ms         = idEv17ms
    , idTaskOnButtonDown = idEvOnButtonDown
    , idTaskCpuLoad      = idEvCpuLoad

    , idTaskOs1ms

    /** The number of tasks to register. */
    , noRegisteredTasks

    /** The interrupts that are applied mainly to produce system load for testing, continue
        the sequence of ids, so that they can share the shared data container with test
        data. */
    , idISRPit1 = noRegisteredTasks
    , idISRPit2
    , idISRPit3

    /** The number of registered tasks and ISRs. */
    , noRegisteredTasksAndISRs

    /** The number of ISRs. */
    , noISRs = noRegisteredTasksAndISRs - noRegisteredTasks

    /** The idle task is not a task under control of the RTOS and it doesn't have an ID.
        We assign it a pseudo task ID that is used to store some task related data in the
        same array here in this sample application as we do by true task ID for all true
        tasks. */
    , idTaskIdle = noRegisteredTasksAndISRs

    /** The number of all concurrent excution threads: The ISRs, the application tasks and
        the idle task. */
    , noExecutionContexts
};


/** The RTOS uses constant task priorities, which are defined here. (The concept and
    architecture of the RTOS allows dynamic changeing of a task's priority at runtime, but
    we didn't provide an API for that yet; where are the use cases?) */
enum
{
    prioTask1ms = 2
    , prioTask3ms = 2
    , prioTask1s = 1
    , prioTaskNonCyclic = 3
    , prioTask17ms = 4
    , prioTaskOnButtonDown = 1
    , prioTaskCpuLoad = 1
    , prioTaskOs1ms = prioTask1ms /* same event, cannot have other prio */
    , prioTaskIdle = 0

    , prioISRPit1 = 5
    , prioISRPit2 = 6
    , prioISRPit3 = 15
};


/** In the RTOS a task belongs to a process. The releationship is defined here. */
enum
{
    pidTask1ms = 1
    , pidTask3ms = 1
    , pidTask1s = 1
    , pidTaskNonCyclic = 1
    , pidTask17ms = 1
    , pidTaskOnButtonDown = 1
    , pidTaskCpuLoad = 1
    , pidTaskOs1ms = 0
    , pidOnButtonChangeCallback = 1
    , pidTaskIdle = 0
};



/*
 * Local prototypes
 */


/*
 * Data definitions
 */

/** A task invokation counter, which is incremented by all application tasks. */
volatile unsigned long long _cntAllTasks SECTION(.bss.Shared) = 0;

/** A cycle counter for each task. The last entry is meant for the idle task. */
volatile unsigned long long _cntTaskAry[noExecutionContexts] SECTION(.bss.Shared) =
                                                        {[0 ... noExecutionContexts-1] = 0};

volatile unsigned long mai_cntTaskIdle SECTION(.bss.OS) = 0  /** Counter of cycles of infinite main loop. */
                     , mai_cntTask1ms SECTION(.bss.P1) = 0   /** Counter of cyclic task. */
                     , mai_cntTask3ms SECTION(.bss.P1) = 0   /** Counter of cyclic task. */
                     , mai_cntTask1s SECTION(.bss.P1) = 0    /** Counter of cyclic task. */
                     , mai_cntTaskNonCyclic SECTION(.bss.P1) = 0  /** Counter of calls of software triggered
                                                     task */
                     , mai_cntTask17ms SECTION(.bss.P1) = 0  /** Counter of cyclic task. */
                     , mai_cntTaskOnButtonDown SECTION(.bss.P1) = 0  /** Counter of button event task. */
                     , mai_cntTaskCpuLoad SECTION(.bss.P1) = 0   /** Counter of cyclic task. */
                     , mai_cntActivationLossTaskNonCyclic SECTION(.bss.P1) = 0  /* Lost activations of non
                                                                  cyclic task by 17ms
                                                                  cyclic task. */
                     , mai_cntISRPit1 SECTION(.bss.OS) = 0
                     , mai_cntISRPit2 SECTION(.bss.OS) = 0
                     , mai_cntISRPit3 SECTION(.bss.OS) = 0;

/** We have an idle task in process 2. */
volatile unsigned int mai_cntTaskIdlePID2 SECTION(.sdata.P2) = 0;

/** The color currently used by the interrupt handlers are controlled through selection of
    a pin. The selection is made by global variable. Here for D5. */
static volatile lbd_led_t _ledTask1s SECTION(.sdata.P1) = lbd_led_D5_grn;

/** The color currently used by the interrupt handlers are controlled through selection of
    a pin. The selection is made by global variable. Here for D4. */
static volatile lbd_led_t _ledTask1ms SECTION(.sdata.P1) = lbd_led_D4_red;

/** The average CPU load produced by all tasks and interrupts in tens of percent. */
unsigned int mai_cpuLoad SECTION(.data.OS) = 1000;

/** Test of CPU load estimation: This variable controls the production of some artificial
    CPU load. This is done in a task of low priority so that all higher prioritized task
    should not or barely be affected. (One LED is, the other isn't affected.) */
static unsigned int _cpuLoadInPercent SECTION(.sdata.P1) = 0;

/** Test of priority ceiling protocol. A sub-set of tasks, whereof non of highest priority
    in use, share this data object. Is has redundant fields so that a sharing conflict can
    be recognized. Try compiling the code with bad resource definition and see if the
    problem is reported (in DEBUG compilation by assertion, too). */
static volatile struct sharedDataTasksIdleAnd1msAndCpuLoad_t
{
    /** Counter incremented on execution of task task1ms. */
    unsigned int cntTask1ms;

    /** Counter incremented on execution of task taskCpuLoad. */
    unsigned int cntTaskCpuLoad;

    /** Counter incremented on execution of the idle task. */
    unsigned int cntTaskIdle;

    /** Total count, sum of all others. */
    unsigned int cntTotal;

