PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/application/default/mai_main.c
    /** The number of recognized data consistency errors. */
    unsigned int noErrors;

} _sharedDataTasksIdleAnd1msAndCpuLoad SECTION(.data.Shared) =
    { .cntTask1ms = 0
    , .cntTaskCpuLoad = 0
    , .cntTaskIdle = 0
    , .cntTotal = 0
    , .noErrors = 0
    };


/*
 * Function implementation
 */

/**
 * Test function, to be called from any of the tasks: A task related counter is incremented
 * and in the same atomic operation is a task-shared counter incremented. The function then
 * validates that the sum of all task related counters is identical to the value of the
 * shared counter. The test result is validated by assertion, i.e. the application is
 * halted in case of an error.
 *   The test is aimed to prove the correct implementation of the offered mutual exclusion
 * mechanisms.
 *   @param idTask
 * The ID (or index) of the calling task. Needed to identify the task related counter.
 */
static void checkAndIncrementTaskCnts(unsigned int idTask)
{
    /* Increment task related counter and shared counter in an atomic operation. */
    assert(idTask < sizeOfAry(_cntTaskAry));
    GetResource(RESOURCE_CNT_TASK_ARY);
    {
        ++ _cntTaskAry[idTask];
        ++ _cntAllTasks;
    }
    ReleaseResource();

    /* Get all task counters and the common counter in an atomic operation. */
    unsigned long long cntTaskAryCpy[noExecutionContexts]
                     , cntAllTasksCpy;
    _Static_assert(sizeof(_cntTaskAry) == sizeof(cntTaskAryCpy), "Bad data definition");
    GetResource(RESOURCE_CNT_TASK_ARY);
    {
        memcpy(&cntTaskAryCpy[0], (void*)&_cntTaskAry[0], sizeof(cntTaskAryCpy));
        cntAllTasksCpy = _cntAllTasks;
    }
    ReleaseResource();

    /* Check consistency of got data. */
/// @todo Neither assert nor an endless loop will halt the SW
    unsigned int u;
    for(u=0; u<noExecutionContexts; ++u)
        cntAllTasksCpy -= cntTaskAryCpy[u];
#ifdef DEBUG
    assert(cntAllTasksCpy == 0);
#else
    /* PRODUCTION compilation: Code execution is halted, LEDs stop blinking as indication
       of a severe problem. */
    if(cntAllTasksCpy != 0)
    {
        ihw_suspendAllInterrupts();
        while(true)
            ;
    }
#endif
} /* End of checkAndIncrementTaskCnts. */



/**
 * Helper function of PCP test: The shared data is checked for consistency and a global
 * error counter is incremented in case.
 *   @return
 * Get \a true as long as everything is alright.
 */
static bool testPCP_checkDataConsistency()
{
    const unsigned int sum = _sharedDataTasksIdleAnd1msAndCpuLoad.cntTaskIdle
                             + _sharedDataTasksIdleAnd1msAndCpuLoad.cntTaskCpuLoad
                             + _sharedDataTasksIdleAnd1msAndCpuLoad.cntTask1ms;
    if(sum != _sharedDataTasksIdleAnd1msAndCpuLoad.cntTotal)
    {
        /* Resynchronize to enable further error recognition. */
        _sharedDataTasksIdleAnd1msAndCpuLoad.cntTotal = sum;

        const unsigned int noErr = _sharedDataTasksIdleAnd1msAndCpuLoad.noErrors+1;
        if(noErr > 0)
            _sharedDataTasksIdleAnd1msAndCpuLoad.noErrors = noErr;

        return false;
    }
    else
        return true;

} /* End of testPCP_checkDataConsistency */


/**
 * Test function for priority ceiling portocol. To be called from a sub-set of tasks, idle
 * task, task1ms and taskCpuLoad.
 *   The test is aimed to prove the correct implementation of the offered mutual exclusion
 * mechanism for this sub-set of tasks.
 *   @param idTask
 * The ID (or index) of the calling task. Needed to identify the task related counter.
 */
static void testPCP(unsigned int idTask)
{
    /* The safe RTOS doesn't offer an idle task to the user code. The idle task belongs
       to the OS context and needs to use the OS variant of the PCP. */
    #define GetResource_OS(resource) \
        { uint32_t priorityLevelSoFar = rtos_OS_suspendAllInterruptsByPriority          \
                                            (/* suspendUpToThisPriority */ (resource));
    #define ReleaseResource_OS() rtos_OS_resumeAllInterruptsByPriority(priorityLevelSoFar); }

    /* Increment task related counter and shared counter in an atomic operation. */
    if(idTask == idTaskIdle)
    {
        GetResource_OS(RESOURCE_TEST_PCP);
        {
            ++ _sharedDataTasksIdleAnd1msAndCpuLoad.cntTaskIdle;
            ++ _sharedDataTasksIdleAnd1msAndCpuLoad.cntTotal;
        }
        ReleaseResource_OS();
    }
    else if(idTask == idTaskCpuLoad)
    {
        GetResource(RESOURCE_TEST_PCP);
        {
            ++ _sharedDataTasksIdleAnd1msAndCpuLoad.cntTaskCpuLoad;
            ++ _sharedDataTasksIdleAnd1msAndCpuLoad.cntTotal;
        }
        ReleaseResource();
    }
    else if(idTask == idTask1ms)
    {
        /* Here, we want to prove that the resource doesn't need to be acquired by a task,
           which has the highest priority in the sub-set.
             Omitting the critical section code invalidates the code if the task priorities
           are redefined in the heading part of the file and we need to put an assertion to
           double check this. */
        _Static_assert( prioTask1ms >= prioTaskIdle  &&  prioTask1ms >= prioTaskCpuLoad
                      , "Task priorities do not meet the requirements of function testPCP"
                      );
        ++ _sharedDataTasksIdleAnd1msAndCpuLoad.cntTask1ms;
        ++ _sharedDataTasksIdleAnd1msAndCpuLoad.cntTotal;
    }
    else
    {
        /* This function is intended only for a sub-set of tasks. */
#ifdef DEBUG
        assert(false);
# else
        ihw_suspendAllInterrupts();
        while(true)
            ;
#endif
    }

    /* Validate the consistency of the redundant data in an atomic operation. */
    bool bOkay;
    if(idTask == idTaskIdle)
    {
        GetResource_OS(RESOURCE_TEST_PCP);
        {
            bOkay = testPCP_checkDataConsistency();
        }
        ReleaseResource_OS();
    }
    else
    {
        GetResource(RESOURCE_TEST_PCP);
        {
            bOkay = testPCP_checkDataConsistency();
        }
        ReleaseResource();
    }

/// @todo Can't work yet. We need to observe the global error counter instead
#if 0
    if(!bOkay)
    {
        /* On desire, the application is halted. This makes the error observable
           without connected terminal. */
#if HALT_ON_PCP_TEST_FAILURE == 1
# ifdef DEBUG
        assert(false);
# else
        ihw_suspendAllInterrupts();
        while(true)
            ;
# endif
#endif
    }
#endif

#undef GetResource_OS
#undef ReleaseResource_OS
} /* End of testPCP. */



/**
 * A regularly triggered interrupt handler for the timer PIT1. The interrupt does nothing
 * but counting a variable. The ISR participates the test of safely sharing data with the
 * application tasks. It is triggered at medium frequency and asynchronously to the
 * kernel's clock tick to prove the system stability and properness of the context
 * switches.
 *   @remark
 * This is a normal interrupt running in the kernel context (supervisor mode, no MPU
 * restrictions).
 */
static void isrPit1(void)
{
/// @todo Like in testPCP we need a differentiation between OS and user task. ISR is OS
//    checkAndIncrementTaskCnts(idISRPit1);
    ++ mai_cntISRPit1;

    /* Acknowledge the interrupt in the causing HW device. Can be done as this is "trusted
       code" that is running in supervisor mode. */
    PIT.TFLG1.B.TIF = 0x1;

} /* End of isrPit1 */



/**
 * A regularly triggered interrupt handler for the timer PIT2. The interrupt does nothing
 * but counting a variable. It is triggered at high frequency and asynchronously to the
 * kernel's clock tick to prove the system stability and properness of the context switches.
 *   @remark
 * This is a normal interrupt running in the kernel context (supervisor mode, no MPU
 * restrictions).
 */
static void isrPit2(void)
{
    ++ mai_cntISRPit2;

    /* Acknowledge the interrupt in the causing HW device. Can be done as this is "trusted
       code" that is running in supervisor mode. */
    PIT.TFLG2.B.TIF = 0x1;

} /* End of isrPit2 */



/**
 * A regularly triggered interrupt handler for the timer PIT3. The interrupt does nothing
 * but counting a variable. It is triggered at high frequency and asynchronously to the
 * kernel's clock tick to prove the system stability and properness of the context switches.
 *   @remark
 * This is a normal interrupt running in the kernel context (supervisor mode, no MPU
 * restrictions).
 */
static void isrPit3(void)
{
    ++ mai_cntISRPit3;

    /* Acknowledge the interrupt in the causing HW device. Can be done as this is "trusted
       code" that is running in supervisor mode. */
    PIT.TFLG3.B.TIF = 0x1;

