PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/application/default/mai_main.c
} /* End of isrPit3 */



/**
 * OS task function, cyclically activated every Millisecond. Used to clock the step
 * functions of our I/O drivers.\n
 *   This task is run in supervisor mode and it has no protection. The implementation
 * belongs into the sphere of trusted code.
 *   @return
 * If the task function returns a negative value then the task execution is counted as
 * error in the process.
 */
static int32_t taskOs1ms(void)
{
    lbd_task1ms();

    return 0;

} /* End of taskOs1ms */


/**
 * Notification callback from the button and LED I/O driver (lbd) in case of a button state
 * change.
 *   @param PID
 * A user task or callback gets the process ID as first argument.
 *   @param buttonState
 * The new, changed button state. See lbd_onButtonChangeCallback_t for details.
 */
static int32_t onButtonChangeCallback(uint32_t PID ATTRIB_UNUSED, uint8_t buttonState)
{
    /* Toggle the LED colors on button SW3 down. */
    if((buttonState & lbd_btStMask_btnSw3_down) != 0)
    {
        static unsigned int cntButtonPress_ SECTION(.sbss.P1) = 0;

        lbd_setLED(_ledTask1s, /* isOn */ false);
        lbd_setLED(_ledTask1ms, /* isOn */ false);
        _ledTask1s  = (cntButtonPress_ & 0x1) != 0? lbd_led_D5_red: lbd_led_D5_grn;
        _ledTask1ms = (cntButtonPress_ & 0x2) != 0? lbd_led_D4_red: lbd_led_D4_grn;

        /* Activate the non cyclic task a second time. The priority of the activated
           task is higher than of this activating task so the first activation should
           have been processed meanwhile and this one should be accepted, too.
             Note, activating one and the same task from different contexts requires a
           critical section. */
        /// @todo Check: Statement about critical section should no longer hold. Remove resource
#ifdef DEBUG
        bool bActivationAccepted;
#endif
        GetResource(RESOURCE_ACTIVATE_TASK_NON_CYCLIC);
        {
#ifdef DEBUG
            bActivationAccepted =
#endif
            rtos_triggerEvent(idEvNonCyclic);
        }
        ReleaseResource();
        assert(bActivationAccepted);

        /* Activate our button down event task. The activation will normally succeed
           but at high load and very fast button press events it is theoretically
           possible that not. We don't place an assertion. */
#ifdef DEBUG
        bActivationAccepted =
#endif
        rtos_triggerEvent(idEvOnButtonDown);
        //assert(bActivationAccepted);

        ++ cntButtonPress_;
    }

    return 0;

} /* End of onButtonChangeCallback */



/**
 * Task function, cyclically activated every Millisecond. The LED D4 is switched on and off
 * and the button SW3 is read and evaluated.
 *   @return
 * If the task function returns a negative value then the task execution is counted as
 * error in the process.
 *   @param PID
 * A user task function gets the process ID as first argument.
 */
static int32_t task1ms(uint32_t PID ATTRIB_UNUSED)
{
    checkAndIncrementTaskCnts(idTask1ms);
    testPCP(idTask1ms);

    ++ mai_cntTask1ms;

    /* Activate the non cyclic task.
         Note, the non cyclic task is of higher priority than this task and it'll be
       executed immediately, preempting this task. The second activation below, on button
       down must not lead to an activation loss.
         Note, activating one and the same task from different contexts requires a critical
       section. */
    GetResource(RESOURCE_ACTIVATE_TASK_NON_CYCLIC);
    {
        rtos_triggerEvent(idEvNonCyclic);
    }
    ReleaseResource();

#if TASKS_PRODUCE_GROUND_LOAD == 1
    /* Produce a bit of CPU load. This call simulates some true application software. */
    del_delayMicroseconds(/* fullLoadThisNoMicroseconds */ 50 /* approx. 5% load */);
#endif

    static int cntIsOn_ SECTION(.sbss.P1) = 0;
    if(++cntIsOn_ >= 500)
        cntIsOn_ = -500;
    lbd_setLED(_ledTask1ms, /* isOn */ cntIsOn_ >= 0);

    return 0;

} /* End of task1ms */




/**
 * Task function, cyclically activated every 3ms.
 *   @return
 * If the task function returns a negative value then the task execution is counted as
 * error in the process.
 *   @param PID
 * A user task function gets the process ID as first argument.
 */
static int32_t task3ms(uint32_t PID ATTRIB_UNUSED)
{
    checkAndIncrementTaskCnts(idTask3ms);
    ++ mai_cntTask3ms;

#if TASKS_PRODUCE_GROUND_LOAD == 1
    /* Produce a bit of CPU load. This call simulates some true application software. */
    del_delayMicroseconds(/* fullLoadThisNoMicroseconds */ 150 /* approx. 5% load */);
#endif

    return 0;

} /* End of task3ms */



/**
 * Task function, cyclically activated every second.
 *   @return
 * If the task function returns a negative value then the task execution is counted as
 * error in the process.
 *   @param PID
 * A user task function gets the process ID as first argument.
 */
static int32_t task1s(uint32_t PID ATTRIB_UNUSED)
{
    checkAndIncrementTaskCnts(idTask1s);

    ++ mai_cntTask1s;

    static int cntIsOn_ SECTION(.sbss.P1) = 0;
    if(++cntIsOn_ >= 1)
        cntIsOn_ = -1;
    lbd_setLED(_ledTask1s, /* isOn */ cntIsOn_ >= 0);

#if TASKS_PRODUCE_GROUND_LOAD == 1
    /* Produce a bit of CPU load. This call simulates some true application software.
         Note, the cyclic task taskCpuLoad has a period time of 23 ms and it has the same
       priority as this task. Because of the busy loop here and because the faster task
       itself has a non negligible execution time, there's a significant chance of loosing
       an activation of the faster task once a second. */
    del_delayMicroseconds(/* fullLoadThisNoMicroseconds */ 20000 /* approx. 2% load */);
#endif

    /* Simple code: First calculation of time to print is wrong. */
    static unsigned long tiPrintf_ SECTION(.sbss.P1) = 0;
    unsigned long long tiFrom = GSL_PPC_GET_TIMEBASE();
    iprintf( "CPU load is %u.%u%%. Stack reserve:\r\n"
             "  OS: %u Byte\r\n"
             "  PID 1: %u Byte\r\n"
             "  PID 2: %u Byte\r\n"
             "  PID 3: %u Byte\r\n"
             "  PID 4: %u Byte\r\n"
             "Task activations (lost):\r\n"
             "  task1ms: %lu (%u)\r\n"
             "  task3ms: %lu (%u)\r\n"
             "  task1s: %lu (%u)\r\n"
             "  taskNonCyclic: %lu (%u)\r\n"
             "  task17ms: %lu (%u)\r\n"
             "  taskOnButtonDown: %lu (%u)\r\n"
             "  taskCpuLoad: %lu (%u)\r\n"
             "  taskIdle: %lu\r\n"
             "  taskIdle PID 2: %u\r\n"
             "Process errors:\r\n"
             "  Total PID 1: %u\r\n"
             "  thereof Deadline missed: %u\r\n"
             "  Total PID 2: %u\r\n"
             "  thereof Deadline missed: %u\r\n"
             "tiPrintf = %luus\r\n"
           , mai_cpuLoad/10, mai_cpuLoad%10
           , rtos_getStackReserve(0)
           , rtos_getStackReserve(1)
           , rtos_getStackReserve(2)
           , rtos_getStackReserve(3)
           , rtos_getStackReserve(4)
           , mai_cntTask1ms, rtos_getNoActivationLoss(idEv1ms)
           , mai_cntTask3ms, rtos_getNoActivationLoss(idEv3ms)
           , mai_cntTask1s, rtos_getNoActivationLoss(idEv1s)
           , mai_cntTaskNonCyclic, rtos_getNoActivationLoss(idEvNonCyclic)
           , mai_cntTask17ms, rtos_getNoActivationLoss(idEv17ms)
           , mai_cntTaskOnButtonDown, rtos_getNoActivationLoss(idEvOnButtonDown)
           , mai_cntTaskCpuLoad, rtos_getNoActivationLoss(idEvCpuLoad)
           , mai_cntTaskIdle
           , mai_cntTaskIdlePID2
           , rtos_getNoTotalTaskFailure(/* PID */ 1)
           , rtos_getNoTaskFailure(/* PID */ 1, IVR_CAUSE_TASK_ABBORTION_DEADLINE)
           , rtos_getNoTotalTaskFailure(/* PID */ 2)
           , rtos_getNoTaskFailure(/* PID */ 2, IVR_CAUSE_TASK_ABBORTION_DEADLINE)
           , tiPrintf_
           );
    tiPrintf_ = (unsigned long)(GSL_PPC_GET_TIMEBASE() - tiFrom) / 120;

