PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/application/default/mai_main.c
    return 0;

} /* End of task1s */



/**
 * A non cyclic task, which is solely activated by software triggers from other tasks.
 *   @return
 * If the task function returns a negative value then the task execution is counted as
 * error in the process.
 *   @param PID
 * A user task function gets the process ID as first argument.
 */
static int32_t taskNonCyclic(uint32_t PID ATTRIB_UNUSED)
{
    checkAndIncrementTaskCnts(idTaskNonCyclic);
    ++ mai_cntTaskNonCyclic;

    return 0;

} /* End of taskNonCyclic */



/**
 * Task function, cyclically activated every 17ms.
 *   @return
 * If the task function returns a negative value then the task execution is counted as
 * error in the process.
 *   @param PID
 * A user task function gets the process ID as first argument.
 */
static int32_t task17ms(uint32_t PID ATTRIB_UNUSED)
{
    checkAndIncrementTaskCnts(idTask17ms);
    ++ mai_cntTask17ms;

    /* This task has a higher priority than the software triggered, non cyclic task. Since
       the latter one is often active we have a significant likelihood of a failing
       activation from here -- always if we preempted the non cyclic task.
         Note, activating one and the same task from different contexts requires a critical
       section. This task had got the high application task priority so that the explicit
       Get/ReleaseResource could be omitted. Doing so would however break the possibility
       to play with the sample code and to arbitrarily change the priorities in the
       heading part of this file. */
    GetResource(RESOURCE_ACTIVATE_TASK_NON_CYCLIC);
    {
        if(!rtos_triggerEvent(idEvNonCyclic))
            ++ mai_cntActivationLossTaskNonCyclic;
    }
    ReleaseResource();

#if TASKS_PRODUCE_GROUND_LOAD == 1
    /* Produce a bit of CPU load. This call simulates some true application software. */
    del_delayMicroseconds(/* fullLoadThisNoMicroseconds */ 17*40 /* approx. 4% load */);
#endif

    /* A task can't activate itself, we do not queue activations and it's obviously active
       at the moment. Test it. */
#ifdef DEBUG
    bool bActivationAccepted =
#endif
    rtos_triggerEvent(idEv17ms);
    assert(!bActivationAccepted);

    return 0;

} /* End of task17ms */



/**
 * A non cyclic task, which is activated by software trigger every time the button on the
 * evaluation board is pressed.
 *   @return
 * If the task function returns a negative value then the task execution is counted as
 * error in the process.
 *   @param PID
 * A user task function gets the process ID as first argument.
 */
static int32_t taskOnButtonDown(uint32_t PID ATTRIB_UNUSED)
{
    checkAndIncrementTaskCnts(idTaskOnButtonDown);
    ++ mai_cntTaskOnButtonDown;
    iprintf("You pressed the button the %lu. time\r\n", mai_cntTaskOnButtonDown);

    /* Change the value of artificial CPU load on every click by 10%. */
    if(_cpuLoadInPercent < 100)
        _cpuLoadInPercent += 10;
    else
        _cpuLoadInPercent = 0;

    iprintf("The additional, artificial CPU load has been set to %u%%\r\n", _cpuLoadInPercent);
#ifdef __VLE__
    /* This code is a work around for a bug in MinGW-powerpc-eabivle-4.9.4. If the code is
       compiled with optimization and for VLE instructions and if the iprintf (likely the
       same for all kinds of printf) is the very last operation of the C function, then the
       compiler emits a Book E instruction instead of the VLE equivalent. The execution goes
       into a trap. See https://community.nxp.com/message/966809 for details.
         Note, this is likely due to a specific optimizer decision, which is really related
       to the conditions "printf" and "last statement" but not a common error, which could
       unpredictedly appear anywhere else. */
    asm volatile ("se_nop\n\t");
#endif

    return 0;

} /* End of taskOnButtonDown */


/**
 * A cyclic task of low priority, which is used to produce some artificial CPU load.
 *   @return
 * If the task function returns a negative value then the task execution is counted as
 * error in the process.
 *   @param PID
 * A user task function gets the process ID as first argument.
 *   @remark
 * We need to consider that in this sample, the measurement is inaccurate because the
 * idle loop is not empty (besides measuring the load) and so the observation window is
 * discontinuous. The task has a cycle time of much less than the CPU measurement
 * observation window, which compensates for the effect of the discontinuous observation
 * window.
 */
static int32_t taskCpuLoad(uint32_t PID ATTRIB_UNUSED)
{
    checkAndIncrementTaskCnts(idTaskCpuLoad);
    testPCP(idTaskCpuLoad);

    /* The next call produces 100 * noCycles*(waitTimePerCycleInUS/1000) / 23 percent of
       CPU load. */
    tcx_testContext(/* noCycles */ 3, /* waitTimePerCycleInUS */ 2000);

    ++ mai_cntTaskCpuLoad;

    /* Producing load is implemented as producing full load for a given span of world time.
       This is not the same as producing an additional load of according percentage to the
       system since the task may be preempted and time elapses while this task is not
       loading the CPU. The percent value is only approximately. */
    const unsigned int tiDelayInUs = 23 /* ms = cycle time of this task */
                                     * 1000 /* ms to us to improve resolution */
                                     * _cpuLoadInPercent
                                     / 100;
    del_delayMicroseconds(/* fullLoadThisNoMicroseconds */ tiDelayInUs);

    return 0;

} /* End of taskCpuLoad */



/**
 * This demonstration software uses a number of fast interrupts to produce system load and
 * prove stability. The interrupts are timer controlled (for simplicity) but the
 * activations are chosen as asynchronous to the operating system clock as possible to
 * provoke a most variable preemption pattern.
 */
static void installInterruptServiceRoutines(void)
{
    /* 0x2: Disable all PIT timers during configuration. Note, this is a
       global setting for all four timers. Accessing the bits makes this rountine have race
       conditions with the RTOS initialization that uses timer PIT0. Both routines must not
       be called in concurrency. */
    PIT.PITMCR.R |= 0x2u;

