PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/application/default/mai_main.c
    /* Install the ISRs now that all timers are stopped.
         Vector numbers: See MCU reference manual, section 28.7, table 28-4. */
    assert(((uintptr_t)isrPit1 & 0x80000000) == 0);
    prc_installINTCInterruptHandler( &isrPit1
                                   , /* vectorNum */ 60
                                   , /* psrPriority */ prioISRPit1
                                   , /* isPreemptable */ true
                                   );

    assert(((uintptr_t)isrPit2 & 0x80000000) == 0);
    prc_installINTCInterruptHandler( &isrPit2
                                   , /* vectorNum */ 61
                                   , /* psrPriority */ prioISRPit2
                                   , /* isPreemptable */ true
                                   );
    assert(((uintptr_t)isrPit3 & 0x80000000) == 0);
    prc_installINTCInterruptHandler( &isrPit3
                                   , /* vectorNum */ 127
                                   , /* psrPriority */ prioISRPit3
                                   , /* isPreemptable */ true
                                   );

    /* Peripheral clock has been initialized to 120 MHz. The timer counts at this rate. The
       RTOS operates in ticks of 1ms we use prime numbers to get good asynchronity with the
       RTOS clock.
         Note, one interrupt is much slower than the two others. The reason is it does much
       more, it takes part at the test of safely accessing data shared with the application
       tasks.
         -1: See MCU reference manual, 36.5.1, p. 1157. */
    PIT.LDVAL1.R = 11987-1;/* Interrupt rate approx. 10kHz */
    PIT.LDVAL2.R = 4001-1; /* Interrupt rate approx. 30kHz */
    PIT.LDVAL3.R = 3989-1; /* Interrupt rate approx. 30kHz */

    /* Enable interrupts by the timers and start them. */
    PIT.TCTRL1.R = 0x3;
    PIT.TCTRL2.R = 0x3;
    PIT.TCTRL3.R = 0x3;

    /* Enable timer operation, all four timers are affected. Interrupt processing should
       start. */
    PIT.PITMCR.R &= ~0x2u;

} /* End of installInterruptServiceRoutines */



/**
 * Initialization task of process \a PID.
 *   @return
 * The function returns the Boolean descision, whether the initialization was alright and
 * the system can start up.
 *   @param PID
 * The ID of the process, the task function is executed in.
 *   @remark
 * In this sample, we demonstrate that different processes' tasks can share the same task
 * function implementation. This is not meant a demonstration of the technical feasibility
 * but not of good practice; the implementation needs to use shared memory, which may break
 * a safety constraint, and it needs to consider the different privileges of the processes.
 */
static int32_t taskInitProcess(uint32_t PID)
{
    static unsigned int cnt_ SECTION(.data.Shared.cnt_) = 0;
    ++ cnt_;

    /* Only process 1 has access to the C lib (more precise: to those functions of the C
       lib, which write to lib owned data objects) and can write a status message. */
    if(PID == 1)
        iprintf("taskInitPID%lu(): %u\r\n", PID, cnt_);

    return cnt_ == PID;

} /* End of taskInitProcess */



/**
 * A short function, which is regularly called from the idle OS process but whic is run in
 * user process context 2.
 *   @return
 * The function returns 3 times \a taskParam (a meaningless test only).
 *   @param PID
 * The ID of the process, the task function is executed in.
 *   @param taskParam
 * Task parameter.
 */
static int32_t taskIdlePID2(uint32_t PID, uint32_t taskParam)
{
    static unsigned int cnt_ SECTION(.sdata.P2) = 0;
    ++ cnt_;
    mai_cntTaskIdlePID2 = cnt_;

    volatile static unsigned int u_ SECTION(.data.P2) = 0;
    for(u_=0; u_<1000; ++u_)
        ;

    return (signed int)(taskParam*PID + taskParam);

} /* taskIdlePID2 */


/**
 * Entry point into C code. The C main function is entered without arguments and despite of
 * its return code definition it must never be left. (Returning from main would enter an
 * infinite loop in the calling assembler startup code.)
 */
void main(void)
{
    /* The first operation of the main function is the call of ihw_initMcuCoreHW(). The
       assembler implemented startup code has brought the MCU in a preliminary working
       state, such that the C compiler constructs can safely work (e.g. stack pointer is
       initialized, memory access through MMU is enabled).
         ihw_initMcuCoreHW() does the remaining hardware initialization, that is still
       needed to bring the MCU in a basic stable working state. The main difference to the
       preliminary working state of the assembler startup code is the selection of
       appropriate clock rates.
         This part of the hardware configuration is widely application independent. The
       only reason, why this code has not been called directly from the assembler code
       prior to entry into main() is code transparency. It would mean to have a lot of C
       code without an obvious point, where it is called. */
    ihw_initMcuCoreHW();

    /* The interrupt controller is configured. */
    prc_initINTCInterruptController();

    /* Initialize the button and LED driver for the eval board. */
    lbd_initLEDAndButtonDriver(onButtonChangeCallback, pidOnButtonChangeCallback);

    /* Initialize the serial output channel as prerequisite of using printf. */
    sio_initSerialInterface(/* baudRate */ 115200);

    /* Arm the memory protection unit. */
    mpu_initMPU();

    /* Register the process initialization tasks. */
    rtos_taskDesc_t taskConfig;
    bool initOk = true;
    taskConfig = (rtos_taskDesc_t){ .PID = 1
                                    , .userTaskFct = taskInitProcess
                                    , .tiTaskMaxInUS = 1000
                                  };
    if(!rtos_registerTask(&taskConfig, RTOS_EVENT_ID_INIT_TASK))
        initOk = false;

    taskConfig = (rtos_taskDesc_t){ .PID = 2
                                    , .userTaskFct = taskInitProcess
                                    , .tiTaskMaxInUS = 1000
                                  };
    if(!rtos_registerTask(&taskConfig, RTOS_EVENT_ID_INIT_TASK))
        initOk = false;

    /* Register the application tasks at the RTOS. Note, we do not really respect the ID,
       which is assigned to the task by the RTOS API rtos_createEvent(). The returned
       value is redundant. This technique requires that we register the task in the right
       order and this requires in practice a double-check by assertion - later maintenance
       errors are unavoidable otherwise. */
#ifdef DEBUG
    unsigned int idEvent =
#endif
    rtos_createEvent(&(rtos_eventDesc_t){ .tiCycleInMs = 1
                                        , .tiFirstActivationInMs = 10
                                        , .priority = prioTask1ms
                                        , .minPIDToTriggerThisEvent = 1
                                        }
                    );
    assert(idEvent == idEv1ms);
    if(!rtos_registerTask( &(rtos_taskDesc_t){ .PID = pidTaskOs1ms
                                             , .osTaskFct = taskOs1ms
                                             , .tiTaskMaxInUS = 0
                                             }
                         , idEv1ms
                         )
      )
    {
        initOk = false;
    }
    if(!rtos_registerTask( &(rtos_taskDesc_t){ .PID = pidTask1ms
                                             , .userTaskFct = task1ms
                                             , .tiTaskMaxInUS = 0
                                             }
                         , idEv1ms
                         )
      )
    {
        initOk = false;
    }

#ifdef DEBUG
    idEvent =
#endif
    rtos_createEvent(&(rtos_eventDesc_t){ .tiCycleInMs = 3
                                        , .tiFirstActivationInMs = 17
                                        , .priority = prioTask3ms
                                        , .minPIDToTriggerThisEvent = 1
                                        }
                    );
    assert(idEvent == idEv3ms);
    if(!rtos_registerTask(&(rtos_taskDesc_t){ .PID = pidTask3ms
                                            , .userTaskFct = task3ms
                                            , .tiTaskMaxInUS = 0
                                            }
                         , idEv3ms
                         )
      )
    {
        initOk = false;
    }

#ifdef DEBUG
    idEvent =
#endif
    rtos_createEvent(&(rtos_eventDesc_t){ .tiCycleInMs = 1000
                                        , .tiFirstActivationInMs = 100
                                        , .priority = prioTask1s
                                        , .minPIDToTriggerThisEvent = 1
                                        }
                    );
    assert(idEvent == idEv1s);
    if(!rtos_registerTask(&(rtos_taskDesc_t){ .PID = pidTask1s
                                            , .userTaskFct = task1s
                                            , .tiTaskMaxInUS = 0
                                            }
                         , idEv1s
                         )
      )
    {
        initOk = false;
    }

#ifdef DEBUG
    idEvent =
#endif
    rtos_createEvent(&(rtos_eventDesc_t){ .tiCycleInMs = 0 /* non-cyclic */
                                        , .tiFirstActivationInMs = 0
                                        , .priority = prioTaskNonCyclic
                                        , .minPIDToTriggerThisEvent = 1
                                        }
                    );
    assert(idEvent == idEvNonCyclic);
    if(!rtos_registerTask(&(rtos_taskDesc_t){ .PID = pidTaskNonCyclic
                                            , .userTaskFct = taskNonCyclic
                                            , .tiTaskMaxInUS = 0
                                            }
                         , idEvNonCyclic
                         )
      )
    {
        initOk = false;
    }

#ifdef DEBUG
    idEvent =
#endif
    rtos_createEvent(&(rtos_eventDesc_t){ .tiCycleInMs = 17
                                        , .tiFirstActivationInMs = 0
                                        , .priority = prioTask17ms
                                        , .minPIDToTriggerThisEvent = 1
                                        }
                    );
    assert(idEvent == idEv17ms);
    if(!rtos_registerTask(&(rtos_taskDesc_t){ .PID = pidTask17ms
                                            , .userTaskFct = task17ms
                                            , .tiTaskMaxInUS = 0
                                            }
                         , idEv17ms
                         )
      )
    {
        initOk = false;
    }

#ifdef DEBUG
    idEvent =
#endif
    rtos_createEvent(&(rtos_eventDesc_t){ .tiCycleInMs = 0 /* Event task, no cycle time */
                                        , .tiFirstActivationInMs = 0
                                        , .priority = prioTaskOnButtonDown
                                        , .minPIDToTriggerThisEvent = 1
                                        }
                    );
    assert(idEvent == idEvOnButtonDown);
    if(!rtos_registerTask(&(rtos_taskDesc_t){ .PID = pidTaskOnButtonDown
                                            , .userTaskFct = taskOnButtonDown
                                            , .tiTaskMaxInUS = 0
                                            }
                         , idEvOnButtonDown
                         )
      )
    {
        initOk = false;
    }

#ifdef DEBUG
    idEvent =
#endif
    rtos_createEvent(&(rtos_eventDesc_t){ .tiCycleInMs = 23 /* ms */
                                        , .tiFirstActivationInMs = 3
                                        , .priority = prioTaskCpuLoad
                                        , .minPIDToTriggerThisEvent = 1
                                        }
                    );
    assert(idEvent == idEvCpuLoad);
    if(!rtos_registerTask(&(rtos_taskDesc_t){ .PID = pidTaskCpuLoad
                                            , .userTaskFct = taskCpuLoad
                                            , .tiTaskMaxInUS = 0
                                            }
                         , idEvCpuLoad
                         )
      )
    {
        initOk = false;
    }

    /* The last check ensures that we didn't forget to register a task. */
    assert(idEvent == noRegisteredTasks-2);

    /* Initialize the RTOS kernel. The global interrupt processing is resumed if it
       succeeds. The step involves a configuration check. We must not startup the SW if the
       check fails. */
    if(!initOk || !rtos_initKernel())
        while(true)
            ;

