PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/application/default/mai_main.c
    /* Installing more interrupts should be possible while the system is already running.
       We place the PIT timer initialization here to prove this statement. */
    del_delayMicroseconds(500000);
    installInterruptServiceRoutines();

    /* The code down here becomes our idle task. It is executed when and only when no
       application task is running. */

    /* Prepare the run of the idle task of process 2. */
    static const prc_userTaskConfig_t taskIdlePID2Config = { .taskFct = taskIdlePID2
                                                           , .tiTaskMax = 0
                                                           , .PID = 2
                                                           };
    while(true)
    {
/// @todo Likely impossible for idle to use these services
//        checkAndIncrementTaskCnts(idTaskIdle);
        testPCP(idTaskIdle);
        ++ mai_cntTaskIdle;

        /* Activate the non cyclic task. Note, the execution time of this task activation
           will by principle not be considered by the CPU load measurement started from the
           same task (the idle task). */
/// @todo Here, we disregard the otherwise used critical section. This error is likely in simple RTOS, too
#ifdef DEBUG
        bool bActivationAccepted =
#endif
        rtos_OS_triggerEvent(idEvNonCyclic);
        assert(bActivationAccepted);

        /* Run a kind of idle task in process 2. */
        signed int resultIdle = rtos_OS_runTask( &taskIdlePID2Config
                                               , /* taskParam */ mai_cntTaskIdle
                                               );
        assert(resultIdle == 3*(int)mai_cntTaskIdle);

        /* Compute the average CPU load. Note, this operation lasts about 1s and has a
           significant impact on the cycling speed of this infinite loop. Furthermore, it
           measures only the load produced by the tasks and system interrupts but not that
           of the rest of the code in the idle loop. */
        mai_cpuLoad = gsl_getSystemLoad();

/// @todo No printf accessible from OS process, does system call, move somewhere else
        /* In PRODUCTION compilation we print the inconsistencies found in the PCP test. */
        if(_sharedDataTasksIdleAnd1msAndCpuLoad.noErrors != 0)
        {
//            iprintf( "CAUTION: %u errors found in PCP self-test!\r\n"
//                   , _sharedDataTasksIdleAnd1msAndCpuLoad.noErrors
//                   );
        }
    }
} /* End of main */
